; domain
(define (domain grid-costs)
  (:requirements :typing :adl :action-costs)
  (:types cell)

  (:predicates
    (at ?c - cell)
    (adj ?from ?to - cell)
  )

  (:functions
    (move-cost ?c - cell)
    (total-cost)
  )

  (:action move
    :parameters (?from ?to - cell)
    :precondition (and
      (at ?from)
      (adj ?from ?to)
    )
    :effect (and
      (not (at ?from))
      (at ?to)
      (increase (total-cost) (move-cost ?to))
    )
  )
)

; problem
(define (problem grid5)
  (:domain grid-costs)
  (:objects
    c0000 - cell
    c0001 - cell
    c0002 - cell
    c0003 - cell
    c0004 - cell
    c0005 - cell
    c0006 - cell
    c0007 - cell
    c0100 - cell
    c0101 - cell
    c0102 - cell
    c0103 - cell
    c0104 - cell
    c0105 - cell
    c0106 - cell
    c0107 - cell
    c0200 - cell
    c0201 - cell
    c0202 - cell
    c0203 - cell
    c0204 - cell
    c0205 - cell
    c0206 - cell
    c0207 - cell
    c0300 - cell
    c0301 - cell
    c0302 - cell
    c0303 - cell
    c0304 - cell
    c0305 - cell
    c0306 - cell
    c0307 - cell
    c0400 - cell
    c0401 - cell
    c0402 - cell
    c0403 - cell
    c0404 - cell
    c0405 - cell
    c0406 - cell
    c0407 - cell
    c0500 - cell
    c0501 - cell
    c0502 - cell
    c0503 - cell
    c0504 - cell
    c0505 - cell
    c0506 - cell
    c0507 - cell
    c0600 - cell
    c0601 - cell
    c0602 - cell
    c0603 - cell
    c0604 - cell
    c0605 - cell
    c0606 - cell
    c0607 - cell
    c0700 - cell
    c0701 - cell
    c0702 - cell
    c0703 - cell
    c0704 - cell
    c0705 - cell
    c0706 - cell
    c0707 - cell
  )

  (:init
    (at c0000)
    (= (move-cost c0000) 1)
    (adj c0000 c0100)
    (adj c0000 c0001)
    (= (move-cost c0001) 4)
    (adj c0001 c0101)
    (adj c0001 c0000)
    (adj c0001 c0002)
    (= (move-cost c0002) 4)
    (adj c0002 c0102)
    (adj c0002 c0001)
    (adj c0002 c0003)
    (= (move-cost c0003) 3)
    (adj c0003 c0103)
    (adj c0003 c0002)
    (adj c0003 c0004)
    (= (move-cost c0004) 3)
    (adj c0004 c0104)
    (adj c0004 c0003)
    (adj c0004 c0005)
    (= (move-cost c0005) 5)
    (adj c0005 c0105)
    (adj c0005 c0004)
    (adj c0005 c0006)
    (= (move-cost c0006) 1)
    (adj c0006 c0106)
    (adj c0006 c0005)
    (adj c0006 c0007)
    (= (move-cost c0007) 4)
    (adj c0007 c0107)
    (adj c0007 c0006)
    (= (move-cost c0100) 2)
    (adj c0100 c0000)
    (adj c0100 c0200)
    (adj c0100 c0101)
    (= (move-cost c0101) 1)
    (adj c0101 c0001)
    (adj c0101 c0201)
    (adj c0101 c0100)
    (adj c0101 c0102)
    (= (move-cost c0102) 3)
    (adj c0102 c0002)
    (adj c0102 c0202)
    (adj c0102 c0101)
    (adj c0102 c0103)
    (= (move-cost c0103) 5)
    (adj c0103 c0003)
    (adj c0103 c0203)
    (adj c0103 c0102)
    (adj c0103 c0104)
    (= (move-cost c0104) 4)
    (adj c0104 c0004)
    (adj c0104 c0204)
    (adj c0104 c0103)
    (adj c0104 c0105)
    (= (move-cost c0105) 4)
    (adj c0105 c0005)
    (adj c0105 c0205)
    (adj c0105 c0104)
    (adj c0105 c0106)
    (= (move-cost c0106) 4)
    (adj c0106 c0006)
    (adj c0106 c0206)
    (adj c0106 c0105)
    (adj c0106 c0107)
    (= (move-cost c0107) 4)
    (adj c0107 c0007)
    (adj c0107 c0207)
    (adj c0107 c0106)
    (= (move-cost c0200) 3)
    (adj c0200 c0100)
    (adj c0200 c0300)
    (adj c0200 c0201)
    (= (move-cost c0201) 1)
    (adj c0201 c0101)
    (adj c0201 c0301)
    (adj c0201 c0200)
    (adj c0201 c0202)
    (= (move-cost c0202) 5)
    (adj c0202 c0102)
    (adj c0202 c0302)
    (adj c0202 c0201)
    (adj c0202 c0203)
    (= (move-cost c0203) 3)
    (adj c0203 c0103)
    (adj c0203 c0303)
    (adj c0203 c0202)
    (adj c0203 c0204)
    (= (move-cost c0204) 3)
    (adj c0204 c0104)
    (adj c0204 c0304)
    (adj c0204 c0203)
    (adj c0204 c0205)
    (= (move-cost c0205) 2)
    (adj c0205 c0105)
    (adj c0205 c0305)
    (adj c0205 c0204)
    (adj c0205 c0206)
    (= (move-cost c0206) 1)
    (adj c0206 c0106)
    (adj c0206 c0306)
    (adj c0206 c0205)
    (adj c0206 c0207)
    (= (move-cost c0207) 5)
    (adj c0207 c0107)
    (adj c0207 c0307)
    (adj c0207 c0206)
    (= (move-cost c0300) 4)
    (adj c0300 c0200)
    (adj c0300 c0400)
    (adj c0300 c0301)
    (= (move-cost c0301) 4)
    (adj c0301 c0201)
    (adj c0301 c0401)
    (adj c0301 c0300)
    (adj c0301 c0302)
    (= (move-cost c0302) 3)
    (adj c0302 c0202)
    (adj c0302 c0402)
    (adj c0302 c0301)
    (adj c0302 c0303)
    (= (move-cost c0303) 5)
    (adj c0303 c0203)
    (adj c0303 c0403)
    (adj c0303 c0302)
    (adj c0303 c0304)
    (= (move-cost c0304) 3)
    (adj c0304 c0204)
    (adj c0304 c0404)
    (adj c0304 c0303)
    (adj c0304 c0305)
    (= (move-cost c0305) 3)
    (adj c0305 c0205)
    (adj c0305 c0405)
    (adj c0305 c0304)
    (adj c0305 c0306)
    (= (move-cost c0306) 3)
    (adj c0306 c0206)
    (adj c0306 c0406)
    (adj c0306 c0305)
    (adj c0306 c0307)
    (= (move-cost c0307) 2)
    (adj c0307 c0207)
    (adj c0307 c0407)
    (adj c0307 c0306)
    (= (move-cost c0400) 1)
    (adj c0400 c0300)
    (adj c0400 c0500)
    (adj c0400 c0401)
    (= (move-cost c0401) 3)
    (adj c0401 c0301)
    (adj c0401 c0501)
    (adj c0401 c0400)
    (adj c0401 c0402)
    (= (move-cost c0402) 5)
    (adj c0402 c0302)
    (adj c0402 c0502)
    (adj c0402 c0401)
    (adj c0402 c0403)
    (= (move-cost c0403) 1)
    (adj c0403 c0303)
    (adj c0403 c0503)
    (adj c0403 c0402)
    (adj c0403 c0404)
    (= (move-cost c0404) 5)
    (adj c0404 c0304)
    (adj c0404 c0504)
    (adj c0404 c0403)
    (adj c0404 c0405)
    (= (move-cost c0405) 5)
    (adj c0405 c0305)
    (adj c0405 c0505)
    (adj c0405 c0404)
    (adj c0405 c0406)
    (= (move-cost c0406) 2)
    (adj c0406 c0306)
    (adj c0406 c0506)
    (adj c0406 c0405)
    (adj c0406 c0407)
    (= (move-cost c0407) 4)
    (adj c0407 c0307)
    (adj c0407 c0507)
    (adj c0407 c0406)
    (= (move-cost c0500) 1)
    (adj c0500 c0400)
    (adj c0500 c0600)
    (adj c0500 c0501)
    (= (move-cost c0501) 4)
    (adj c0501 c0401)
    (adj c0501 c0601)
    (adj c0501 c0500)
    (adj c0501 c0502)
    (= (move-cost c0502) 4)
    (adj c0502 c0402)
    (adj c0502 c0602)
    (adj c0502 c0501)
    (adj c0502 c0503)
    (= (move-cost c0503) 2)
    (adj c0503 c0403)
    (adj c0503 c0603)
    (adj c0503 c0502)
    (adj c0503 c0504)
    (= (move-cost c0504) 1)
    (adj c0504 c0404)
    (adj c0504 c0604)
    (adj c0504 c0503)
    (adj c0504 c0505)
    (= (move-cost c0505) 5)
    (adj c0505 c0405)
    (adj c0505 c0605)
    (adj c0505 c0504)
    (adj c0505 c0506)
    (= (move-cost c0506) 3)
    (adj c0506 c0406)
    (adj c0506 c0606)
    (adj c0506 c0505)
    (adj c0506 c0507)
    (= (move-cost c0507) 5)
    (adj c0507 c0407)
    (adj c0507 c0607)
    (adj c0507 c0506)
    (= (move-cost c0600) 4)
    (adj c0600 c0500)
    (adj c0600 c0700)
    (adj c0600 c0601)
    (= (move-cost c0601) 4)
    (adj c0601 c0501)
    (adj c0601 c0701)
    (adj c0601 c0600)
    (adj c0601 c0602)
    (= (move-cost c0602) 4)
    (adj c0602 c0502)
    (adj c0602 c0702)
    (adj c0602 c0601)
    (adj c0602 c0603)
    (= (move-cost c0603) 1)
    (adj c0603 c0503)
    (adj c0603 c0703)
    (adj c0603 c0602)
    (adj c0603 c0604)
    (= (move-cost c0604) 2)
    (adj c0604 c0504)
    (adj c0604 c0704)
    (adj c0604 c0603)
    (adj c0604 c0605)
    (= (move-cost c0605) 3)
    (adj c0605 c0505)
    (adj c0605 c0705)
    (adj c0605 c0604)
    (adj c0605 c0606)
    (= (move-cost c0606) 3)
    (adj c0606 c0506)
    (adj c0606 c0706)
    (adj c0606 c0605)
    (adj c0606 c0607)
    (= (move-cost c0607) 1)
    (adj c0607 c0507)
    (adj c0607 c0707)
    (adj c0607 c0606)
    (= (move-cost c0700) 3)
    (adj c0700 c0600)
    (adj c0700 c0701)
    (= (move-cost c0701) 1)
    (adj c0701 c0601)
    (adj c0701 c0700)
    (adj c0701 c0702)
    (= (move-cost c0702) 4)
    (adj c0702 c0602)
    (adj c0702 c0701)
    (adj c0702 c0703)
    (= (move-cost c0703) 4)
    (adj c0703 c0603)
    (adj c0703 c0702)
    (adj c0703 c0704)
    (= (move-cost c0704) 5)
    (adj c0704 c0604)
    (adj c0704 c0703)
    (adj c0704 c0705)
    (= (move-cost c0705) 4)
    (adj c0705 c0605)
    (adj c0705 c0704)
    (adj c0705 c0706)
    (= (move-cost c0706) 2)
    (adj c0706 c0606)
    (adj c0706 c0705)
    (adj c0706 c0707)
    (= (move-cost c0707) 5)
    (adj c0707 c0607)
    (adj c0707 c0706)
    (= (total-cost) 0)
  )

  (:goal (at c0707))
  (:metric minimize (total-cost))
)

; plan
1. (move c0000 c0100)
   deleted: (at c0000)
   added: (at c0100)
   goals met: 0 of 1
2. (move c0100 c0101)
   deleted: (at c0100)
   added: (at c0101)
   goals met: 0 of 1
3. (move c0101 c0201)
   deleted: (at c0101)
   added: (at c0201)
   goals met: 0 of 1
4. (move c0201 c0301)
   deleted: (at c0201)
   added: (at c0301)
   goals met: 0 of 1
5. (move c0301 c0302)
   deleted: (at c0301)
   added: (at c0302)
   goals met: 0 of 1
6. (move c0302 c0303)
   deleted: (at c0302)
   added: (at c0303)
   goals met: 0 of 1
7. (move c0303 c0403)
   deleted: (at c0303)
   added: (at c0403)
   goals met: 0 of 1
8. (move c0403 c0503)
   deleted: (at c0403)
   added: (at c0503)
   goals met: 0 of 1
9. (move c0503 c0504)
   deleted: (at c0503)
   added: (at c0504)
   goals met: 0 of 1
10. (move c0504 c0604)
   deleted: (at c0504)
   added: (at c0604)
   goals met: 0 of 1
11. (move c0604 c0605)
   deleted: (at c0604)
   added: (at c0605)
   goals met: 0 of 1
12. (move c0605 c0606)
   deleted: (at c0605)
   added: (at c0606)
   goals met: 0 of 1
13. (move c0606 c0607)
   deleted: (at c0606)
   added: (at c0607)
   goals met: 0 of 1
14. (move c0607 c0707)
   deleted: (at c0607)
   added: (at c0707)
   goals met: 1 of 1
